while True: 
	print("################################################################################")
	print("##                                                                            ##")
	print("##                                                                            ##")                          
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                  Welcome                                   ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("################################################################################")                      
	 



	print("################################################################################")         
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")            
	print("##                                                                            ##")
	print("##                                 ราคาน้ำมัน                                   ##")
	print("##                         1.Gasoline 95 ราคา 29.19 บาท                       ##")
	print("##                         2.Gasoline 91 ราคา 25.31 บาท                       ##")  
	print("##                         3.Gasohol 91  ราคา 21.68 บาท                       ##")
	print("##                         4.Gasohol E20 ราคา 20.2  บาท                       ##")
	print("##                         5.Gasohol 95  ราคา 21.2  บาท                       ##")
	print("##                         6.Diesel      ราคา 21.1  บาท                       ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("################################################################################")

	o = int(input())

	# 1.เงินเป็นลิตร
	# 2.ลิตรเป็นเงิน

	print("################################################################################")         
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")            
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                   คำนวณ                                    ##")
	print("##                               1.เงินเป็นลิตร                                  ##")
	print("##                               2.ลิตรเป็นเงิน                                  ##")                
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("################################################################################")


	s = int(input())

	print("################################################################################")         
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")            
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                  กรอกจำนวนลิตร/เงิน                          ##") 
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("##                                                                            ##")
	print("################################################################################")

	p = int(input())

	if (o == 1):
		if(s == 1):
			total = p / 29.19
		elif(s == 2):
			total = p * 29.19
	elif (o == 2):
		if(s == 1):
			total = p / 25.31
		elif(s == 2):
			total = p * 25.31
	elif (o == 3):
		if(s == 1):
			total = p / 21.68
		elif(s == 2):
			total = p * 21.68
	elif (o == 4):
		if(s == 1):
			total = p / 20.2
		elif(s == 2):
			total = p * 20.2
	elif (o == 5):
		if(s == 1):
			total = p / 21.2
		elif(s == 2):
			total = p * 21.2
	elif (o == 6):
		if(s == 1):
			total = p / 21.1
		elif(s == 2):
			total = p * 21.1


	print(total)
	inp_exit = input()
	if (inp_exit == "exit"):
		break

  

















